CF/Enums/ТипыОплатЧекаККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыОплатЧекаККМ</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатежнаяКарта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскийКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бонусы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗачетАванса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРассрочку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CF/Catalogs/ЭквайринговыеТерминалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ЭквайринговыеТерминалы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РозничнаяТорговля</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезПодключенияОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эквайрер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорЭквайринга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьДоговорыЭквайринга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТарифыЗаРасчетноеОбслуживание</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОплатЧекаККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКомиссииПриПродаже</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКомиссииПриОтмене</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентКомиссииПриВозврате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/Catalogs/ВидыОплатЧекаККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ВидыОплатЧекаККМ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОплатЧекаККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанкКредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентБанковскойКомиссии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/CommonModules/ЭквайрингВызовСервера/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает процент торговой уступки для переданных
// договора эквайринга и вида оплаты - платежная карта.
//
// Параметры:
//  ЭквайринговыйТерминал - Эквайринговый терминал, по которому нужно получить % торговой уступки.
//  ВидОплаты - вид оплаты, для которого  нужно получить % торговой уступки.
//
// Возвращаемое значение:
//  Число. Процент торговой уступки. 0 - если не найден.
//
Функция ПолучитьПроцентКомиссииДляПлатежнойКарты(ЭквайринговыйТерминал, ВидОплаты, ЭтоВозврат = Ложь, ЭтоВозвратДеньВДень = Ложь) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Тарифы.ПроцентКомиссииПриПродаже КАК ПроцентКомиссииПриПродаже,
	|	Тарифы.ПроцентКомиссииПриВозврате КАК ПроцентКомиссииПриВозврате,
	|	Тарифы.ПроцентКомиссииПриОтмене КАК ПроцентКомиссииПриОтмене
	|ИЗ
	|	Справочник.ЭквайринговыеТерминалы.ТарифыЗаРасчетноеОбслуживание КАК Тарифы
	|ГДЕ
	|	Тарифы.Ссылка = &ЭквайринговыйТерминал
	|	И (Тарифы.ВидОплаты = &ВидОплаты
	|			ИЛИ Тарифы.ВидОплаты = ЗНАЧЕНИЕ(Справочник.ВидыОплатЧекаККМ.ПустаяСсылка))");
		
	Запрос.УстановитьПараметр("ЭквайринговыйТерминал", ЭквайринговыйТерминал);
	Запрос.УстановитьПараметр("ВидОплаты", ВидОплаты);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ЭтоВозврат Тогда
			Если ЭтоВозвратДеньВДень Тогда
				ПроцентКомиссии = Выборка.ПроцентКомиссииПриОтмене;
			Иначе
				ПроцентКомиссии = Выборка.ПроцентКомиссииПриВозврате;
			КонецЕсли; 
		Иначе
			ПроцентКомиссии = Выборка.ПроцентКомиссииПриПродаже;
		КонецЕсли;
	Иначе
		ПроцентКомиссии = 0;
	КонецЕсли;
	
	Возврат ПроцентКомиссии;
	
КонецФункции

// По виду оплаты заполняет банка-кредитора и процент комиссии;
//
// Параметры:
//  ВидОплаты                 - Справочник "ВидыОплатЧекаККМ"
//  БанкКредитор              - Справочник "Контрагенты"
//  ПроцентБанковскойКомиссии - Число
//
Процедура ЗаполнитьБанкиПроцентКомиссии(ВидОплаты, БанкКредитор, ПроцентБанковскойКомиссии) Экспорт

	БанкКредитор              = ВидОплаты.БанкКредитор;
	ПроцентБанковскойКомиссии = ВидОплаты.ПроцентБанковскойКомиссии;

КонецПроцедуры // ЗаполнитьБанкиПроцентКомиссии()

// Функция возвращает процент торговой уступки для переданных
// вида оплаты - банковский кредит.
//
// Параметры:
//  ВидОплаты - вид оплаты, для которого  нужно получить % торговой уступки.
//
// Возвращаемое значение:
//  Число. Процент торговой уступки. 0 - если не найден.
//
Функция ПолучитьПроцентКомиссииБанковскийКредит(ВидОплаты) Экспорт

	Возврат ВидОплаты.ПроцентБанковскойКомиссии;

КонецФункции // ПолучитьПроцентКомиссииБанковскийКредит()

// Функция возвращает процент торговой уступки.
//
// Параметры:
// Параметры:
//  ТерминалЭквайринга - Эквайринговый терминал, по которому нужно получить % торговой уступки.
//  ВидОплаты - вид оплаты, для которого  нужно получить % торговой уступки.
//
// Возвращаемое значение:
//  Число. Процент торговой уступки. 0 - если не найден.
//
Функция ПолучитьПроцентКомиссии(ТерминалЭквайринга, ВидОплаты, ЭтоВозврат = Ложь, ЭтоВозвратДеньВДень = Ложь) Экспорт
	
	ТипОплаты = ВидОплаты.ТипОплаты;
	
	Если ТипОплаты = Перечисления.ТипыОплатЧекаККМ.ПлатежнаяКарта Тогда
		
		Возврат ПолучитьПроцентКомиссииДляПлатежнойКарты(ТерминалЭквайринга, ВидОплаты, ЭтоВозврат, ЭтоВозвратДеньВДень);
		
	ИначеЕсли ТипОплаты = Перечисления.ТипыОплатЧекаККМ.БанковскийКредит Тогда
		
		Возврат ПолучитьПроцентКомиссииБанковскийКредит(ВидОплаты);
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции // ПолучитьПроцентТорговойНаценки()

// Функция возвращает процент торговой уступки.
//
// Параметры:
//  ТерминалЭквайринга - эквайринговый терминал, по которому нужно получить % торговой уступки.
//  ВидОплаты - вид оплаты, для которого  нужно получить % торговой уступки.
//
// Возвращаемое значение:
//  Число. Процент торговой уступки. 0 - если не найден.
//
Функция ПолучитьПроцентКомиссииПоТерминалу(ТерминалЭквайринга, ВидОплаты, ЭтоВозврат = Ложь, ЭтоВозвратДеньВДень = Ложь) Экспорт
	
	Возврат ПолучитьПроцентКомиссии(ТерминалЭквайринга, ВидОплаты, ЭтоВозврат, ЭтоВозвратДеньВДень);
	
КонецФункции // ПолучитьПроцентТорговойНаценки()

#КонецОбласти
